src/Reports/ОтчетПоНормированиюSMD/ОтчетПоНормированиюSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормированиюSMD</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ВыполнениеЭтаповПроизводства/ВыполнениеЭтаповПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеЭтаповПроизводства</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МТК</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыSMD/НормыSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыSMD</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаНормоЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыОптическогоТеста/НормыОптическогоТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыОптическогоТеста</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыЭлектроконтроля/НормыЭлектроконтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыЭлектроконтроля</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПередачаНаЛинейку/ПередачаНаЛинейку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаНаЛинейку</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиНаЛинейки</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Reports/ОтчетПоНормированиюSMD/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьЛиниюSMD(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.ЛинияSMD
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &МТК";
Запрос.УстановитьПараметр("МТК", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ЛинияSMD);
	КонецЦикла;
Возврат(Справочники.ЛинииSMD.ПустаяСсылка());
КонецФункции

&НаСервере
Функция ПолучитьДатуПередачиНаЛинейку(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаНаЛинейку.Дата
	|ИЗ
	|	Документ.ПередачаНаЛинейку КАК ПередачаНаЛинейку
	|ГДЕ
	|	ПередачаНаЛинейку.ДокументОснование = &МТК";
Запрос.УстановитьПараметр("МТК", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаПЗ.Очистить();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	Макет = ОбъектЗн.ПолучитьМакет("МакетДляДокумента");
	Иначе
	Макет = ОбъектЗн.ПолучитьМакет("Макет");
	КонецЕсли;
ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблСтрокаОбщая = Макет.ПолучитьОбласть("Строка|Общая");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблШапкаСТ = Макет.ПолучитьОбласть("Шапка|СТ");
ОблСтрокаСТ = Макет.ПолучитьОбласть("Строка|СТ");
ОблКонецСТ = Макет.ПолучитьОбласть("Конец|СТ");
ОблШапкаОТ_ЭК = Макет.ПолучитьОбласть("Шапка|ОТ_ЭК");
ОблСтрокаОТ_ЭК = Макет.ПолучитьОбласть("Строка|ОТ_ЭК");
ОблКонецОТ_ЭК = Макет.ПолучитьОбласть("Конец|ОТ_ЭК");

ПрефиксРМ = СокрЛП(СписокРабочихМест[0].Значение.ГруппаРабочихМест.Префикс);

ОблШапкаОбщая.Параметры.ДатаНач = Отчет.ДатаНачала;
ОблШапкаОбщая.Параметры.ДатаКон = Отчет.ДатаОкончания;
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ОблШапкаОбщая.Параметры.ВидДокумента = ТипЗнч(ЭтаФорма.Параметры.Документ);
	ОблШапкаОбщая.Параметры.Подразделение = ЭтаФорма.Параметры.Документ.Подразделение;
	ОблШапкаОбщая.Параметры.Комментарий = ЭтаФорма.Параметры.Документ.Комментарий;
	КонецЕсли;
ТабДок.Вывести(ОблШапкаОбщая);
	Если ПрефиксРМ = "СТ" Тогда
	ТабДок.Присоединить(ОблШапкаСТ);
	ИначеЕсли ПрефиксРМ = "ОТ" Тогда
	ОблШапкаОТ_ЭК.Параметры.Парам = "К-т.";
	ТабДок.Присоединить(ОблШапкаОТ_ЭК);
	ИначеЕсли ПрефиксРМ = "ЭК" Тогда
	ОблШапкаОТ_ЭК.Параметры.Парам = "НВ";		
	ТабДок.Присоединить(ОблШапкаОТ_ЭК);
	КонецЕсли; 

СписокМТК = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеЭтаповПроизводства.МТК КАК МТК,
	|	ВыполнениеЭтаповПроизводства.Спецификация КАК Спецификация,
	|	ВыполнениеЭтаповПроизводства.Исполнитель КАК Исполнитель,
	|	ВыполнениеЭтаповПроизводства.Количество КАК Количество,
	|	ВыполнениеЭтаповПроизводства.Период КАК Период
	|ИЗ
	|	РегистрСведений.ВыполнениеЭтаповПроизводства КАК ВыполнениеЭтаповПроизводства
	|ГДЕ
	|	ВыполнениеЭтаповПроизводства.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыполнениеЭтаповПроизводства.РабочееМесто В ИЕРАРХИИ(&СписокРабочихМест)";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ВыполнениеЭтаповПроизводства.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.ДатаОкончания);
Запрос.УстановитьПараметр("СписокРабочихМест", СписокРабочихМест);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ЛинияSMD = ПолучитьЛиниюSMD(ВыборкаДетальныеЗаписи.МТК);
		Если СписокЛинийSMD.Количество() > 0 Тогда
			Если СписокЛинийSMD.НайтиПоЗначению(ЛинияSMD) = Неопределено Тогда
			Продолжить;			
			КонецЕсли;
		КонецЕсли;
	ТЧ = ТаблицаПЗ.Добавить();
	ТЧ.МТК = ВыборкаДетальныеЗаписи.МТК;
	ТЧ.Изделие = ВыборкаДетальныеЗаписи.МТК.Номенклатура;
	ТЧ.ЭтапСпецификации = ВыборкаДетальныеЗаписи.Спецификация;
	ТЧ.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
	ТЧ.ДатаВыполнения = ВыборкаДетальныеЗаписи.Период;
	ТЧ.КоличествоИзгот = ВыборкаДетальныеЗаписи.Количество;
	ТЧ.ЛинияSMD = ЛинияSMD;
	ТЧ.ДатаВыпуска = ПолучитьДатуПередачиНаЛинейку(ВыборкаДетальныеЗаписи.МТК);
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		ТаблицаПЗ.Сортировать("МТК,Изделие,Исполнитель");
		ИначеЕсли СортироватьПо = 2 Тогда
		ТаблицаПЗ.Сортировать("Изделие,МТК,Исполнитель");
		ИначеЕсли СортироватьПо = 3 Тогда	
		ТаблицаПЗ.Сортировать("Исполнитель,МТК,Изделие");
		ИначеЕсли СортироватьПо = 4 Тогда	
		ТаблицаПЗ.Сортировать("ДатаВыполнения,МТК,Изделие");
		ИначеЕсли СортироватьПо = 5 Тогда	
		ТаблицаПЗ.Сортировать("ДатаВыпуска,МТК,Изделие");
		КонецЕсли;
НомСтр = 0;
КолИзготВсего = 0;
СтоимостьИтогоВсего = 0;
СтоимостьВсего = 0;
	Для каждого ТЧ Из ТаблицаПЗ Цикл
	НомСтр = НомСтр + 1;
	ОблСтрокаОбщая.Параметры.НомСтр = НомСтр;
	ОблСтрокаОбщая.Параметры.Исполнитель = ТЧ.Исполнитель;
	ОблСтрокаОбщая.Параметры.Линейка = ТЧ.МТК.Линейка;
	ОблСтрокаОбщая.Параметры.Линия = ТЧ.ЛинияSMD;
	ОблСтрокаОбщая.Параметры.НомерМТК = ТЧ.МТК.Номер;
	ОблСтрокаОбщая.Параметры.МТК = ТЧ.МТК;
	ОблСтрокаОбщая.Параметры.Статус = ПолучитьСтатус(ТЧ.ЭтапСпецификации);
	ОблСтрокаОбщая.Параметры.НаименованиеИзделия = СокрЛП(ТЧ.Изделие.Наименование);
	ОблСтрокаОбщая.Параметры.Изделие = ТЧ.Изделие;
	ОблСтрокаОбщая.Параметры.НаименованиеСпецификации = СокрЛП(ТЧ.ЭтапСпецификации.Наименование);
	ОблСтрокаОбщая.Параметры.ЭтапСпецификации = ТЧ.ЭтапСпецификации;
	ОблСтрокаОбщая.Параметры.ДатаВыполнения = Формат(ТЧ.ДатаВыполнения,"ДФ=dd.MM.yyyy");
	ОблСтрокаОбщая.Параметры.ДатаВыпуска = Формат(ТЧ.ДатаВыпуска,"ДФ=dd.MM.yyyy");
	ОблСтрокаОбщая.Параметры.КолМТК = ТЧ.МТК.Количество;
	ОблСтрокаОбщая.Параметры.КолИзгот = ТЧ.КоличествоИзгот;
	ТабДок.Вывести(ОблСтрокаОбщая); 
		Если ПрефиксРМ = "СТ" Тогда
		НормыSMD = РегистрыСведений.НормыSMD.ПолучитьПоследнее(ТЧ.ДатаВыполнения,Новый Структура("МПЗ,ЛинияSMD",ТЧ.ЭтапСпецификации,ТЧ.ЛинияSMD));
		ОблСтрокаСТ.Параметры.НВ = НормыSMD.НормаВремени;
		ОблСтрокаСТ.Параметры.НЧ = НормыSMD.ЦенаНормоЧаса;
		ОблСтрокаСТ.Параметры.ВремяИзгот = ТЧ.КоличествоИзгот*НормыSMD.НормаВремени;
		ОблСтрокаСТ.Параметры.Куп = 1;
		Стоимость = ТЧ.КоличествоИзгот*НормыSMD.ЦенаНормоЧаса;
		ОблСтрокаСТ.Параметры.Стоимость = Формат(Стоимость,"ЧЦ=9; ЧДЦ=2");
		ОблСтрокаСТ.Параметры.Кр = ТЧ.Исполнитель.Должность.КоэффициентРазряда;
		СтоимостьИтого = Стоимость*ОблСтрокаСТ.Параметры.Кр;
		ОблСтрокаСТ.Параметры.СтоимостьИтого = Формат(СтоимостьИтого,"ЧЦ=9; ЧДЦ=2");
		КолИзготВсего = КолИзготВсего + ТЧ.КоличествоИзгот;
		СтоимостьИтогоВсего = СтоимостьИтогоВсего + СтоимостьИтого;
		ТекОбл = ТабДок.Присоединить(ОблСтрокаСТ);
			Если НормыSMD.ЦенаНормоЧаса = 0 Тогда
			ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Право).ЦветФона = WebЦвета.Коралловый;
			КонецЕсли;
		ИначеЕсли ПрефиксРМ = "ОТ" Тогда
		НормыSMD = РегистрыСведений.НормыОптическогоТеста.ПолучитьПоследнее(ТЧ.ДатаВыполнения,Новый Структура("МПЗ",ТЧ.ЭтапСпецификации));
		ОблСтрокаОТ_ЭК.Параметры.Парам = НормыSMD.Коэффициент;
		ОблСтрокаОТ_ЭК.Параметры.Расценка = НормыSMD.Расценка;
		Стоимость = ТЧ.КоличествоИзгот*НормыSMD.Расценка;
		ОблСтрокаОТ_ЭК.Параметры.Стоимость = Формат(Стоимость,"ЧЦ=9; ЧДЦ=2");
		КолИзготВсего = КолИзготВсего + ТЧ.КоличествоИзгот;
		СтоимостьВсего = СтоимостьВсего + Стоимость;
		ТекОбл = ТабДок.Присоединить(ОблСтрокаОТ_ЭК);
			Если НормыSMD.Расценка = 0 Тогда
			ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Право).ЦветФона = WebЦвета.Коралловый;
			КонецЕсли;
		ИначеЕсли ПрефиксРМ = "ЭК" Тогда
		НормыSMD = РегистрыСведений.НормыЭлектроконтроля.ПолучитьПоследнее(ТЧ.ДатаВыполнения,Новый Структура("МПЗ",ТЧ.ЭтапСпецификации));		
		ОблСтрокаОТ_ЭК.Параметры.Парам = НормыSMD.НормаВремени;
		ОблСтрокаОТ_ЭК.Параметры.Расценка = НормыSMD.Расценка;
		Стоимость = ТЧ.КоличествоИзгот*НормыSMD.Расценка;
		ОблСтрокаОТ_ЭК.Параметры.Стоимость = Формат(Стоимость,"ЧЦ=9; ЧДЦ=2");
		КолИзготВсего = КолИзготВсего + ТЧ.КоличествоИзгот;
		СтоимостьВсего = СтоимостьВсего + Стоимость;
		ТекОбл = ТабДок.Присоединить(ОблСтрокаОТ_ЭК);
			Если НормыSMD.Расценка = 0 Тогда
			ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Право).ЦветФона = WebЦвета.Коралловый;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
ОблКонецОбщая.Параметры.КолИзготВсего = КолИзготВсего;
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ОблКонецОбщая.Параметры.Мастер = ЭтаФорма.Параметры.Документ.Автор;
	ОблКонецОбщая.Параметры.ЗаместительНачальникаПоУправлениюРесурсами = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Заместитель начальника по управлению ресурсами");
	ОблКонецОбщая.Параметры.НачальникПЭО = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник ПЭО");
	КонецЕсли;
ТабДок.Вывести(ОблКонецОбщая);
	Если ПрефиксРМ = "СТ" Тогда
	ОблКонецСТ.Параметры.СтоимостьИтогоВсего = Формат(СтоимостьИтогоВсего,"ЧЦ=9; ЧДЦ=2");
	ТабДок.Присоединить(ОблКонецСТ);
	ИначеЕсли ПрефиксРМ = "ОТ" Тогда
	ОблКонецОТ_ЭК.Параметры.СтоимостьВсего = Формат(СтоимостьВсего,"ЧЦ=9; ЧДЦ=2");
	ТабДок.Присоединить(ОблКонецОТ_ЭК);
	ИначеЕсли ПрефиксРМ = "ЭК" Тогда
	ОблКонецОТ_ЭК.Параметры.СтоимостьВсего = Формат(СтоимостьВсего,"ЧЦ=9; ЧДЦ=2");		
	ТабДок.Присоединить(ОблКонецОТ_ЭК);
	КонецЕсли;
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЛинеек()
СписокЛинеек = Новый СписокЗначений;

	Для каждого РМ Из СписокРабочихМест Цикл	
	СписокЛинеек.Добавить(РМ.Значение.Линейка);
	КонецЦикла; 
Возврат(СписокЛинеек);
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
СписокЛинеек = ПолучитьСписокЛинеек();
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокЛинеек) Тогда
		СформироватьНаСервере();		
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("Исполнитель") Тогда
	Исполнитель = ЭтаФорма.Параметры.Исполнитель;
	Элементы.Исполнитель.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыДокумента(Документ)
Отчет.ДатаНачала = НачалоМесяца(Документ.Дата)+25200;			
Отчет.ДатаОкончания = КонецМесяца(Документ.Дата)+25200; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ПолучитьПараметрыДокумента(ЭтаФорма.Параметры.Документ);
	СписокРабочихМест.Очистить();
	СписокРабочихМест.Добавить(ЭтаФорма.Параметры.РабочееМесто);
	Сформировать(Неопределено);   	
	КонецЕсли;
КонецПроцедуры
